// for...in გამოიყენება ობიექტის ან მასივის საკვანძო ელემენტების (key) გადასავლელად.
// ის აბრუნებს ყოველი ელემენტის ინდექსს (მასივისთვის) ან ქის სახელს (ობიექტისთვის)

const user = {
  name: "ვატო",
  age: 14,
  hobby: "Coding"
};

for (let key in user) {
  console.log(key + ": " + user[key]);
}

// შედეგი:
// name: ვატო
// age: 14
// hobby: Coding


// for...of გამოიყენება **მოცემული iterable ელემენტების (value)** გადასავლელად,
// მაგალითად მასივის ან სტრინგის შემთხვევებში.

const fruits = ["ვაშლი", "ბანანი", "მსხალი"];

for (let fruit of fruits) {
  console.log(fruit);
}

// შედეგი:
// ვაშლი
// ბანანი
// მსხალი

